---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.CurrentUsersDataFolderPath
source: html/39698a5d-01fd-7aff-9df4-2d5ca1504930.htm
---
# Autodesk.Revit.ApplicationServices.Application.CurrentUsersDataFolderPath Property

Path to data folder for the current user.

## Syntax (C#)
```csharp
public string CurrentUsersDataFolderPath { get; }
```

## Remarks
Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]